Autodesk.Revit.Exceptions.AutoJoinFailedException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.AutoJoinFailedException
The exception that is thrown when an autojoin operation failed.